docs/MFUploadService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions name="MFUploadService" targetNamespace="http://bsestarmfdemo.bseindia.com/2016/01/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
    xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex"
    xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy"
    xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract"
    xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:tns="http://bsestarmfdemo.bseindia.com/2016/01/" xmlns:wsa10="http://www.w3.org/2005/08/addressing"
    xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
    <wsp:Policy wsu:Id="WSHttpBinding_IMFUploadService_policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <wsaw:UsingAddressing />
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="WSHttpBinding_IMFUploadService1_policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
                    <wsp:Policy>
                        <sp:TransportToken>
                            <wsp:Policy>
                                <sp:HttpsToken RequireClientCertificate="false" />
                            </wsp:Policy>
                        </sp:TransportToken>
                        <sp:AlgorithmSuite>
                            <wsp:Policy>
                                <sp:Basic256 />
                            </wsp:Policy>
                        </sp:AlgorithmSuite>
                        <sp:Layout>
                            <wsp:Policy>
                                <sp:Strict />
                            </wsp:Policy>
                        </sp:Layout>
                    </wsp:Policy>
                </sp:TransportBinding>
                <wsaw:UsingAddressing />
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsdl:types>
        <xs:schema elementFormDefault="qualified" targetNamespace="http://bsestarmfdemo.bseindia.com/2016/01/"
            xmlns:xs="http://www.w3.org/2001/XMLSchema">
            <xs:element name="getPassword">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="UserId" nillable="true" type="xs:string" />
                        <xs:element minOccurs="0" name="MemberId" nillable="true" type="xs:string" />
                        <xs:element minOccurs="0" name="Password" nillable="true" type="xs:string" />
                        <xs:element minOccurs="0" name="PassKey" nillable="true" type="xs:string" />
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="getPasswordResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="getPasswordResult" nillable="true" type="xs:string" />
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="MFAPI">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="Flag" nillable="true" type="xs:string" />
                        <xs:element minOccurs="0" name="UserId" nillable="true" type="xs:string" />
                        <xs:element minOccurs="0" name="EncryptedPassword" nillable="true" type="xs:string" />
                        <xs:element minOccurs="0" name="param" nillable="true" type="xs:string" />
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="MFAPIResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="MFAPIResult" nillable="true" type="xs:string" />
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
        </xs:schema>
        <xs:schema attributeFormDefault="qualified" elementFormDefault="qualified"
            targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/"
            xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/">
            <xs:element name="anyType" nillable="true" type="xs:anyType" />
            <xs:element name="anyURI" nillable="true" type="xs:anyURI" />
            <xs:element name="base64Binary" nillable="true" type="xs:base64Binary" />
            <xs:element name="boolean" nillable="true" type="xs:boolean" />
            <xs:element name="byte" nillable="true" type="xs:byte" />
            <xs:element name="dateTime" nillable="true" type="xs:dateTime" />
            <xs:element name="decimal" nillable="true" type="xs:decimal" />
            <xs:element name="double" nillable="true" type="xs:double" />
            <xs:element name="float" nillable="true" type="xs:float" />
            <xs:element name="int" nillable="true" type="xs:int" />
            <xs:element name="long" nillable="true" type="xs:long" />
            <xs:element name="QName" nillable="true" type="xs:QName" />
            <xs:element name="short" nillable="true" type="xs:short" />
            <xs:element name="string" nillable="true" type="xs:string" />
            <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte" />
            <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt" />
            <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong" />
            <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort" />
            <xs:element name="char" nillable="true" type="tns:char" />
            <xs:simpleType name="char">
                <xs:restriction base="xs:int" />
            </xs:simpleType>
            <xs:element name="duration" nillable="true" type="tns:duration" />
            <xs:simpleType name="duration">
                <xs:restriction base="xs:duration">
                    <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?" />
                    <xs:minInclusive value="-P10675199DT2H48M5.4775808S" />
                    <xs:maxInclusive value="P10675199DT2H48M5.4775807S" />
                </xs:restriction>
            </xs:simpleType>
            <xs:element name="guid" nillable="true" type="tns:guid" />
            <xs:simpleType name="guid">
                <xs:restriction base="xs:string">
                    <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}" />
                </xs:restriction>
            </xs:simpleType>
            <xs:attribute name="FactoryType" type="xs:QName" />
            <xs:attribute name="Id" type="xs:ID" />
            <xs:attribute name="Ref" type="xs:IDREF" />
        </xs:schema>
    </wsdl:types>
    <wsdl:message name="IMFUploadService_getPassword_InputMessage">
        <wsdl:part name="parameters" element="tns:getPassword" />
    </wsdl:message>
    <wsdl:message name="IMFUploadService_getPassword_OutputMessage">
        <wsdl:part name="parameters" element="tns:getPasswordResponse" />
    </wsdl:message>
    <wsdl:message name="IMFUploadService_MFAPI_InputMessage">
        <wsdl:part name="parameters" element="tns:MFAPI" />
    </wsdl:message>
    <wsdl:message name="IMFUploadService_MFAPI_OutputMessage">
        <wsdl:part name="parameters" element="tns:MFAPIResponse" />
    </wsdl:message>
    <wsdl:portType name="IMFUploadService">
        <wsdl:operation name="getPassword">
            <wsdl:input wsaw:Action="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/getPassword"
                message="tns:IMFUploadService_getPassword_InputMessage" />
            <wsdl:output wsaw:Action="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/getPasswordResponse"
                message="tns:IMFUploadService_getPassword_OutputMessage" />
        </wsdl:operation>
        <wsdl:operation name="MFAPI">
            <wsdl:input wsaw:Action="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/MFAPI"
                message="tns:IMFUploadService_MFAPI_InputMessage" />
            <wsdl:output wsaw:Action="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/MFAPIResponse"
                message="tns:IMFUploadService_MFAPI_OutputMessage" />
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="WSHttpBinding_IMFUploadService" type="tns:IMFUploadService">
        <wsp:PolicyReference URI="#WSHttpBinding_IMFUploadService_policy" />
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
        <wsdl:operation name="getPassword">
            <soap12:operation soapAction="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/getPassword"
                style="document" />
            <wsdl:input>
                <soap12:body use="literal" />
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal" />
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="MFAPI">
            <soap12:operation soapAction="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/MFAPI"
                style="document" />
            <wsdl:input>
                <soap12:body use="literal" />
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal" />
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:binding name="WSHttpBinding_IMFUploadService1" type="tns:IMFUploadService">
        <wsp:PolicyReference URI="#WSHttpBinding_IMFUploadService1_policy" />
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
        <wsdl:operation name="getPassword">
            <soap12:operation soapAction="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/getPassword"
                style="document" />
            <wsdl:input>
                <soap12:body use="literal" />
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal" />
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="MFAPI">
            <soap12:operation soapAction="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/MFAPI"
                style="document" />
            <wsdl:input>
                <soap12:body use="literal" />
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal" />
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="MFUploadService">
        <wsdl:port name="WSHttpBinding_IMFUploadService" binding="tns:WSHttpBinding_IMFUploadService">
            <soap12:address location="http://bsestarmfdemo.bseindia.com/MFUploadService/MFUploadService.svc/Basic" />
            <wsa10:EndpointReference>
                <wsa10:Address>http://bsestarmfdemo.bseindia.com/MFUploadService/MFUploadService.svc/Basic
                </wsa10:Address>
            </wsa10:EndpointReference>
        </wsdl:port>
        <wsdl:port name="WSHttpBinding_IMFUploadService1" binding="tns:WSHttpBinding_IMFUploadService1">
            <soap12:address location="https://bsestarmfdemo.bseindia.com/MFUploadService/MFUploadService.svc/Secure" />
            <wsa10:EndpointReference>
                <wsa10:Address>https://bsestarmfdemo.bseindia.com/MFUploadService/MFUploadService.svc/Secure
                </wsa10:Address>
            </wsa10:EndpointReference>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>