src/main/resources/bseXmlRequests/getPasswordResponseMFAPI.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ns="http://bsestarmfdemo.bseindia.com/2016/01/">
  <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:To>http://bsestarmfdemo.bseindia.com/MFUploadService/MFUploadService.svc</wsa:To>
		<wsa:Action>http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/getPassword</wsa:Action>
	</soap:Header>
   <soap:Body>
      <ns:getPassword>
         <!--Optional:-->
         <ns:UserId></ns:UserId>
         <!--Optional:-->
         <ns:MemberId></ns:MemberId>
         <!--Optional:-->
         <ns:Password></ns:Password>
         <!--Optional:-->
         <ns:PassKey></ns:PassKey>
      </ns:getPassword>
   </soap:Body>
</soap:Envelope>