src/main/resources/bseXmlRequests/getPasswordRequestMFAPI.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ns="http://bsestarmfdemo.bseindia.com/2016/01/">
   <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:To>http://bsestarmfdemo.bseindia.com/MFUploadService/MFUploadService.svc/Basic</wsa:To>
		<wsa:Action>http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/getPassword</wsa:Action>
	</soap:Header>
   <soap:Body>
     <ns:getPassword>
         <!--Optional:-->
         <ns:UserId>1424501</ns:UserId>
         <!--Optional:-->
         <ns:MemberId>14245</ns:MemberId>
         <!--Optional:-->
         <ns:Password>F1nlabs</ns:Password>
         <!--Optional:-->
         <ns:PassKey>DA3F5</ns:PassKey>
      </ns:getPassword>
   </soap:Body>
</soap:Envelope>